const cards = [
  {
    title: "دروغ سیزده",
    description:
      "یک دروغ درباره خودتان بگویید و با تایید گرداننده از بازی خارج شوید",
  },
  {
    title: "ذهن زیبا",
    description:
      "نقش یک فرد را حدس بزنید، درصورت درست بودن حدس، در بازی خواهید ماند",
  },
  {
    title: "جشن مافیا",
    description: "فردا هیچ کس در روز از بازی خارج نمیشود",
  },
  {
    title: "سرشماری",
    description: "تعداد مافیا ها و شهروندان مانده در بازی اعلام میشود",
  },
  {
    title: "بخت و اقبال",
    description:
      "یک نفر را انتخاب کنید، تا بین شما و ایشان قرعه مرگ انداخته شود و برندۀ این قرعه در بازی خواهد ماند",
  },
  {
    title: "فرش قرمز",
    description: "فردی که فرش قرمز بگیرد فردا مستقیم به دفاعیه میرود",
  },
  {
    title: "بی خوابی",
    description: "شب نخواهیم داشت و مستقیما به روز بعد خواهیم رفت",
  },
  {
    title: "شهر در امان",
    description:
      "امشب هیچ یک از شهروندان به هیچ وجه از بازی بیرون نخواهند رفت، حتی اگر حرفه ای یا کلانتر (اسنایپر) اشتباه تیر بزنند",
  },
  {
    title: "نبش قبر",
    description:
      "یک فرد که از بازی بیرون رفته را انتخاب کرده و نقشش را فاش کنید",
  },
  {
    title: "خوش شانسی",
    description: "در بازی خواهی ماند",
  },
  {
    title: "مسیر سبز",
    description: "فردی که مسیر سبز بگیرد تحت هیچ شرایطی به دفاعیه نخواهد رفت",
  },
  {
    title: "خداحافظ",
    description: "از بازی خارج شوید تا روند بازی ادامه یابد",
  },
  {
    title: "روز محاکمه",
    description:
      "فردا به محض اینکه روز شود رأی گیری میشود و صحبتی انجام نمیشود",
  },
  {
    title: "افشای هویت",
    description: "نقشتان را افشا کنید و از بازی خارج شوید",
  },
  {
    title: "سرگیجه",
    description:
      "یک نفر را به گرداننده اعلام کنید و توانایی او را به مدت یک روز از او سلب کنید",
  },
  {
    title: "شلیک نهایی",
    description: "در اول شب، به جای مافیا، شما شلیک میکنید",
  },
  {
    title: "افشای نقش",
    description:
      "یک نفر از بازیکنان درون بازی را انتخاب کنید تا نقشش توسط گرداننده افشا شود",
  },
  {
    title: "اعلام حضور",
    description:
      "اگر رییس مافیا یا همان گادفادر در بازی زنده باشد، توسط گرداننده اعلام خواهد شد",
  },
  {
    title: "روز سکوت",
    description: "یک نفر را انتخاب میکند و این شخص فردا سکوت میکند",
  },
];

export const exit_cards_fa = { cards };
